#### Terraform Plan (dev) 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.aws_caller_identity.current: Reading...
data.aws_iam_policy_document.assume_eks-worker_role: Reading...
data.aws_vpc.conquer-vpc: Reading...
aws_eip.vpc_eip["eu-north-1a"]: Refreshing state... [id=eipalloc-034d8431cf352f761]
data.aws_iam_policy_document.assume_eks_role: Reading...
aws_eip.vpc_eip["eu-north-1b"]: Refreshing state... [id=eipalloc-0df911083b7b1b2bc]
data.aws_iam_policy_document.assume_eks-worker_role: Read complete after 0s [id=2851119427]
data.aws_iam_policy_document.assume_eks_role: Read complete after 0s [id=3552664922]
aws_iam_role.eks_worker_role: Refreshing state... [id=dev-conquer-eks-worker-role]
aws_iam_role.eks_role: Refreshing state... [id=dev-conquer-eks-role]
data.aws_caller_identity.current: Read complete after 0s [id=014630368052]
aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy: Refreshing state... [id=dev-conquer-eks-worker-role-20231030092414813500000004]
aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy: Refreshing state... [id=dev-conquer-eks-worker-role-20231030092414724000000002]
aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=dev-conquer-eks-worker-role-20231030092414765700000003]
aws_iam_role_policy_attachment.AmazonEC2RoleforSSM: Refreshing state... [id=dev-conquer-eks-worker-role-20231030092414864000000005]
aws_iam_role_policy_attachment.AmazonEKSClusterPolicy: Refreshing state... [id=dev-conquer-eks-role-20231030092414682000000001]
data.aws_vpc.conquer-vpc: Read complete after 1s [id=vpc-080a377054fdb71a7]
aws_subnet.eks_subnets_public["eu-north-1b"]: Refreshing state... [id=subnet-087a158c30f848a16]
aws_route_table.private_subnet_rt["eu-north-1a"]: Refreshing state... [id=rtb-0f5c335288f79b464]
aws_subnet.eks_subnets_private["eu-north-1a"]: Refreshing state... [id=subnet-0b694b1b65d102250]
aws_route_table.private_subnet_rt["eu-north-1b"]: Refreshing state... [id=rtb-062a926c83619f3cf]
aws_subnet.eks_subnets_public["eu-north-1a"]: Refreshing state... [id=subnet-08365c4fce5b2629e]
aws_subnet.eks_subnets_private["eu-north-1b"]: Refreshing state... [id=subnet-0721b5f5ce21f83cb]
aws_nat_gateway.nat_gw["eu-north-1b"]: Refreshing state... [id=nat-09a057706d21981bc]
aws_nat_gateway.nat_gw["eu-north-1a"]: Refreshing state... [id=nat-07aa2f79a2dbd00c5]
aws_route_table_association.private_subnet_rt_association["eu-north-1a"]: Refreshing state... [id=rtbassoc-005def0412d189432]
aws_route_table_association.private_subnet_rt_association["eu-north-1b"]: Refreshing state... [id=rtbassoc-02f547f7ece29961a]
aws_eks_cluster.eks: Refreshing state... [id=dev-conquer-cluster]
aws_route.nat_access["eu-north-1b"]: Refreshing state... [id=r-rtb-062a926c83619f3cf1080289494]
aws_route.nat_access["eu-north-1a"]: Refreshing state... [id=r-rtb-0f5c335288f79b4641080289494]
data.tls_certificate.eks: Reading...
aws_iam_role.AmazonEKS_EBS_CSI_DriverRole: Refreshing state... [id=AmazonEKS_EBS_CSI_DriverRole]
aws_eks_addon.example: Refreshing state... [id=dev-conquer-cluster:vpc-cni]
aws_eks_node_group.node-group["eu-north-1b"]: Refreshing state... [id=dev-conquer-cluster:dev-conquer-node-group-1]
aws_eks_node_group.node-group["eu-north-1a"]: Refreshing state... [id=dev-conquer-cluster:dev-conquer-node-group-0]
aws_eks_addon.aws-ebs-csi-driver: Refreshing state... [id=dev-conquer-cluster:aws-ebs-csi-driver]
aws_iam_role_policy_attachment.AmazonEBSCSIDriverPolicy-attachment: Refreshing state... [id=AmazonEKS_EBS_CSI_DriverRole-2023103009321202390000000c]
helm_release.argocd: Refreshing state... [id=argocd]
data.tls_certificate.eks: Read complete after 0s [id=5007ea61dfb4fcd4db18c0c232d56bef3b07d3dc]
aws_iam_openid_connect_provider.eks-idp: Refreshing state... [id=arn:aws:iam::014630368052:oidc-provider/oidc.eks.eu-north-1.amazonaws.com/id/08CB0786D93B72ADF4F57465A55A420B]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eks_node_group.node-group["eu-north-1a"] must be replaced
-/+ resource "aws_eks_node_group" "node-group" {
      ~ ami_type               = "AL2_x86_64" -> (known after apply)
      ~ arn                    = "arn:aws:eks:eu-north-1:014630368052:nodegroup/dev-conquer-cluster/dev-conquer-node-group-0/0ec5bff6-9668-0ce4-a18a-8b22646a421a" -> (known after apply)
      ~ disk_size              = 20 -> (known after apply)
      ~ id                     = "dev-conquer-cluster:dev-conquer-node-group-0" -> (known after apply)
      ~ instance_types         = [ # forces replacement
          - "t3.micro",
          + "t3.small",
        ]
      - labels                 = {} -> null
      + node_group_name_prefix = (known after apply)
      ~ release_version        = "1.28.1-20231002" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-dev-conquer-node-group-0-0ec5bff6-9668-0ce4-a18a-8b22646a421a"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> (known after apply)
      ~ status                 = "ACTIVE" -> (known after apply)
      - tags                   = {} -> null
      ~ version                = "1.28" -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ scaling_config {
          ~ desired_size = 3 -> 2
          ~ max_size     = 3 -> 2
            # (1 unchanged attribute hidden)
        }

      ~ update_config {
          - max_unavailable_percentage = 0 -> null
            # (1 unchanged attribute hidden)
        }
    }

  # aws_eks_node_group.node-group["eu-north-1b"] must be replaced
-/+ resource "aws_eks_node_group" "node-group" {
      ~ ami_type               = "AL2_x86_64" -> (known after apply)
      ~ arn                    = "arn:aws:eks:eu-north-1:014630368052:nodegroup/dev-conquer-cluster/dev-conquer-node-group-1/86c5bff6-9657-a8bc-a48c-a25957add64d" -> (known after apply)
      ~ disk_size              = 20 -> (known after apply)
      ~ id                     = "dev-conquer-cluster:dev-conquer-node-group-1" -> (known after apply)
      ~ instance_types         = [ # forces replacement
          - "t3.micro",
          + "t3.small",
        ]
      - labels                 = {} -> null
      + node_group_name_prefix = (known after apply)
      ~ release_version        = "1.28.1-20231002" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-dev-conquer-node-group-1-86c5bff6-9657-a8bc-a48c-a25957add64d"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> (known after apply)
      ~ status                 = "ACTIVE" -> (known after apply)
      - tags                   = {} -> null
      ~ version                = "1.28" -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ scaling_config {
          ~ desired_size = 3 -> 2
          ~ max_size     = 3 -> 2
            # (1 unchanged attribute hidden)
        }

      ~ update_config {
          - max_unavailable_percentage = 0 -> null
            # (1 unchanged attribute hidden)
        }
    }

  # helm_release.argocd is tainted, so must be replaced
-/+ resource "helm_release" "argocd" {
      ~ id                         = "argocd" -> (known after apply)
      + manifest                   = (known after apply)
      ~ metadata                   = [
          - {
              - app_version = "v2.8.5"
              - chart       = "argo-cd"
              - name        = "argocd"
              - namespace   = "argocd"
              - revision    = 1
              - values      = jsonencode(
                    {
                      - server = {
                          - service = {
                              - type = "LoadBalancer"
                            }
                        }
                    }
                )
              - version     = "5.48.1"
            },
        ] -> (known after apply)
        name                       = "argocd"
      ~ status                     = "failed" -> "deployed"
        # (25 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.out"

```

</details>

*Pusher: @benhur-araujo, Action: `pull_request`, Working Directory: ``, Workflow: `create-ephemeral-resources`*